ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ctbm.h
#define CTBM_CTD_SW_CTDH_COB_Msk          (0x400UL)             /*!< CTBM CTD_SW: CTDH_COB (Bitfield-Mask: 0x01)               */
#define CTBM_CTD_SW_CTDH_CHD_Pos          (12UL)                /*!< CTBM CTD_SW: CTDH_CHD (Bit 12)                            */
#define CTBM_CTD_SW_CTDH_CHD_Msk          (0x1000UL)            /*!< CTBM CTD_SW: CTDH_CHD (Bitfield-Mask: 0x01)               */
#define CTBM_CTD_SW_CTDH_CA0_Pos          (13UL)                /*!< CTBM CTD_SW: CTDH_CA0 (Bit 13)                            */
#define CTBM_CTD_SW_CTDH_CA0_Msk          (0x2000UL)            /*!< CTBM CTD_SW: CTDH_CA0 (Bitfield-Mask: 0x01)               */
#define CTBM_CTD_SW_CTDH_CIS_Pos          (14UL)                /*!< CTBM CTD_SW: CTDH_CIS (Bit 14)                            */
#define CTBM_CTD_SW_CTDH_CIS_Msk          (0x4000UL)            /*!< CTBM CTD_SW: CTDH_CIS (Bitfield-Mask: 0x01)               */
#define CTBM_CTD_SW_CTDH_ILR_Pos          (15UL)                /*!< CTBM CTD_SW: CTDH_ILR (Bit 15)                            */
#define CTBM_CTD_SW_CTDH_ILR_Msk          (0x8000UL)            /*!< CTBM CTD_SW: CTDH_ILR (Bitfield-Mask: 0x01)               */
/* ===================================================  CTBM.CTD_SW_CLEAR  =================================================== */
#define CTBM_CTD_SW_CLEAR_CTDD_CRD_Pos    (1UL)                 /*!< CTBM CTD_SW_CLEAR: CTDD_CRD (Bit 1)                       */
#define CTBM_CTD_SW_CLEAR_CTDD_CRD_Msk    (0x2UL)               /*!< CTBM CTD_SW_CLEAR: CTDD_CRD (Bitfield-Mask: 0x01)         */
#define CTBM_CTD_SW_CLEAR_CTDS_CRS_Pos    (4UL)                 /*!< CTBM CTD_SW_CLEAR: CTDS_CRS (Bit 4)                       */
#define CTBM_CTD_SW_CLEAR_CTDS_CRS_Msk    (0x10UL)              /*!< CTBM CTD_SW_CLEAR: CTDS_CRS (Bitfield-Mask: 0x01)         */
#define CTBM_CTD_SW_CLEAR_CTDS_COR_Pos    (5UL)                 /*!< CTBM CTD_SW_CLEAR: CTDS_COR (Bit 5)                       */
#define CTBM_CTD_SW_CLEAR_CTDS_COR_Msk    (0x20UL)              /*!< CTBM CTD_SW_CLEAR: CTDS_COR (Bitfield-Mask: 0x01)         */
#define CTBM_CTD_SW_CLEAR_CTDO_C6H_Pos    (8UL)                 /*!< CTBM CTD_SW_CLEAR: CTDO_C6H (Bit 8)                       */
#define CTBM_CTD_SW_CLEAR_CTDO_C6H_Msk    (0x100UL)             /*!< CTBM CTD_SW_CLEAR: CTDO_C6H (Bitfield-Mask: 0x01)         */
#define CTBM_CTD_SW_CLEAR_CTDO_COS_Pos    (9UL)                 /*!< CTBM CTD_SW_CLEAR: CTDO_COS (Bit 9)                       */
#define CTBM_CTD_SW_CLEAR_CTDO_COS_Msk    (0x200UL)             /*!< CTBM CTD_SW_CLEAR: CTDO_COS (Bitfield-Mask: 0x01)         */
#define CTBM_CTD_SW_CLEAR_CTDH_COB_Pos    (10UL)                /*!< CTBM CTD_SW_CLEAR: CTDH_COB (Bit 10)                      */
#define CTBM_CTD_SW_CLEAR_CTDH_COB_Msk    (0x400UL)             /*!< CTBM CTD_SW_CLEAR: CTDH_COB (Bitfield-Mask: 0x01)         */
#define CTBM_CTD_SW_CLEAR_CTDH_CHD_Pos    (12UL)                /*!< CTBM CTD_SW_CLEAR: CTDH_CHD (Bit 12)                      */
#define CTBM_CTD_SW_CLEAR_CTDH_CHD_Msk    (0x1000UL)            /*!< CTBM CTD_SW_CLEAR: CTDH_CHD (Bitfield-Mask: 0x01)         */
#define CTBM_CTD_SW_CLEAR_CTDH_CA0_Pos    (13UL)                /*!< CTBM CTD_SW_CLEAR: CTDH_CA0 (Bit 13)                      */
#define CTBM_CTD_SW_CLEAR_CTDH_CA0_Msk    (0x2000UL)            /*!< CTBM CTD_SW_CLEAR: CTDH_CA0 (Bitfield-Mask: 0x01)         */
#define CTBM_CTD_SW_CLEAR_CTDH_CIS_Pos    (14UL)                /*!< CTBM CTD_SW_CLEAR: CTDH_CIS (Bit 14)                      */
#define CTBM_CTD_SW_CLEAR_CTDH_CIS_Msk    (0x4000UL)            /*!< CTBM CTD_SW_CLEAR: CTDH_CIS (Bitfield-Mask: 0x01)         */
#define CTBM_CTD_SW_CLEAR_CTDH_ILR_Pos    (15UL)                /*!< CTBM CTD_SW_CLEAR: CTDH_ILR (Bit 15)                      */
#define CTBM_CTD_SW_CLEAR_CTDH_ILR_Msk    (0x8000UL)            /*!< CTBM CTD_SW_CLEAR: CTDH_ILR (Bitfield-Mask: 0x01)         */
/* ==================================================  CTBM.CTB_SW_DS_CTRL  ================================================== */
#define CTBM_CTB_SW_DS_CTRL_P2_DS_CTRL23_Pos (10UL)             /*!< CTBM CTB_SW_DS_CTRL: P2_DS_CTRL23 (Bit 10)                */
#define CTBM_CTB_SW_DS_CTRL_P2_DS_CTRL23_Msk (0x400UL)          /*!< CTBM CTB_SW_DS_CTRL: P2_DS_CTRL23 (Bitfield-Mask: 0x01)   */
#define CTBM_CTB_SW_DS_CTRL_P3_DS_CTRL23_Pos (11UL)             /*!< CTBM CTB_SW_DS_CTRL: P3_DS_CTRL23 (Bit 11)                */
#define CTBM_CTB_SW_DS_CTRL_P3_DS_CTRL23_Msk (0x800UL)          /*!< CTBM CTB_SW_DS_CTRL: P3_DS_CTRL23 (Bitfield-Mask: 0x01)   */
#define CTBM_CTB_SW_DS_CTRL_CTD_COS_DS_CTRL_Pos (31UL)          /*!< CTBM CTB_SW_DS_CTRL: CTD_COS_DS_CTRL (Bit 31)             */
#define CTBM_CTB_SW_DS_CTRL_CTD_COS_DS_CTRL_Msk (0x80000000UL)  /*!< CTBM CTB_SW_DS_CTRL: CTD_COS_DS_CTRL (Bitfield-Mask: 0x01)*/
/* ==================================================  CTBM.CTB_SW_SQ_CTRL  ================================================== */
#define CTBM_CTB_SW_SQ_CTRL_P2_SQ_CTRL23_Pos (10UL)             /*!< CTBM CTB_SW_SQ_CTRL: P2_SQ_CTRL23 (Bit 10)                */
#define CTBM_CTB_SW_SQ_CTRL_P2_SQ_CTRL23_Msk (0x400UL)          /*!< CTBM CTB_SW_SQ_CTRL: P2_SQ_CTRL23 (Bitfield-Mask: 0x01)   */
#define CTBM_CTB_SW_SQ_CTRL_P3_SQ_CTRL23_Pos (11UL)             /*!< CTBM CTB_SW_SQ_CTRL: P3_SQ_CTRL23 (Bit 11)                */
#define CTBM_CTB_SW_SQ_CTRL_P3_SQ_CTRL23_Msk (0x800UL)          /*!< CTBM CTB_SW_SQ_CTRL: P3_SQ_CTRL23 (Bitfield-Mask: 0x01)   */
/* ==================================================  CTBM.CTB_SW_STATUS  =================================================== */
#define CTBM_CTB_SW_STATUS_OA0O_D51_STAT_Pos (28UL)             /*!< CTBM CTB_SW_STATUS: OA0O_D51_STAT (Bit 28)                */
#define CTBM_CTB_SW_STATUS_OA0O_D51_STAT_Msk (0x10000000UL)     /*!< CTBM CTB_SW_STATUS: OA0O_D51_STAT (Bitfield-Mask: 0x01)   */
#define CTBM_CTB_SW_STATUS_OA1O_D52_STAT_Pos (29UL)             /*!< CTBM CTB_SW_STATUS: OA1O_D52_STAT (Bit 29)                */
#define CTBM_CTB_SW_STATUS_OA1O_D52_STAT_Msk (0x20000000UL)     /*!< CTBM CTB_SW_STATUS: OA1O_D52_STAT (Bitfield-Mask: 0x01)   */
#define CTBM_CTB_SW_STATUS_OA1O_D62_STAT_Pos (30UL)             /*!< CTBM CTB_SW_STATUS: OA1O_D62_STAT (Bit 30)                */
#define CTBM_CTB_SW_STATUS_OA1O_D62_STAT_Msk (0x40000000UL)     /*!< CTBM CTB_SW_STATUS: OA1O_D62_STAT (Bitfield-Mask: 0x01)   */
#define CTBM_CTB_SW_STATUS_CTD_COS_STAT_Pos (31UL)              /*!< CTBM CTB_SW_STATUS: CTD_COS_STAT (Bit 31)                 */
#define CTBM_CTB_SW_STATUS_CTD_COS_STAT_Msk (0x80000000UL)      /*!< CTBM CTB_SW_STATUS: CTD_COS_STAT (Bitfield-Mask: 0x01)    */
/* =================================================  CTBM.OA0_OFFSET_TRIM  ================================================== */
#define CTBM_OA0_OFFSET_TRIM_OA0_OFFSET_TRIM_Pos (0UL)          /*!< CTBM OA0_OFFSET_TRIM: OA0_OFFSET_TRIM (Bit 0)             */
#define CTBM_OA0_OFFSET_TRIM_OA0_OFFSET_TRIM_Msk (0x3fUL)       /*!< CTBM OA0_OFFSET_TRIM: OA0_OFFSET_TRIM (Bitfield-Mask: 0x3f)*/
/* ==============================================  CTBM.OA0_SLOPE_OFFSET_TRIM  =============================================== */
#define CTBM_OA0_SLOPE_OFFSET_TRIM_OA0_SLOPE_OFFSET_TRIM_Pos (0UL) /*!< CTBM OA0_SLOPE_OFFSET_TRIM: OA0_SLOPE_OFFSET_TRIM (Bit 0)*/
#define CTBM_OA0_SLOPE_OFFSET_TRIM_OA0_SLOPE_OFFSET_TRIM_Msk (0x3fUL) /*!< CTBM OA0_SLOPE_OFFSET_TRIM: OA0_SLOPE_OFFSET_TRIM (Bitfield-Mask: 0x3f)*/
/* ==================================================  CTBM.OA0_COMP_TRIM  =================================================== */
#define CTBM_OA0_COMP_TRIM_OA0_COMP_TRIM_Pos (0UL)              /*!< CTBM OA0_COMP_TRIM: OA0_COMP_TRIM (Bit 0)                 */
#define CTBM_OA0_COMP_TRIM_OA0_COMP_TRIM_Msk (0x3UL)            /*!< CTBM OA0_COMP_TRIM: OA0_COMP_TRIM (Bitfield-Mask: 0x03)   */
/* =================================================  CTBM.OA1_OFFSET_TRIM  ================================================== */
#define CTBM_OA1_OFFSET_TRIM_OA1_OFFSET_TRIM_Pos (0UL)          /*!< CTBM OA1_OFFSET_TRIM: OA1_OFFSET_TRIM (Bit 0)             */
#define CTBM_OA1_OFFSET_TRIM_OA1_OFFSET_TRIM_Msk (0x3fUL)       /*!< CTBM OA1_OFFSET_TRIM: OA1_OFFSET_TRIM (Bitfield-Mask: 0x3f)*/
/* ==============================================  CTBM.OA1_SLOPE_OFFSET_TRIM  =============================================== */
#define CTBM_OA1_SLOPE_OFFSET_TRIM_OA1_SLOPE_OFFSET_TRIM_Pos (0UL) /*!< CTBM OA1_SLOPE_OFFSET_TRIM: OA1_SLOPE_OFFSET_TRIM (Bit 0)*/
#define CTBM_OA1_SLOPE_OFFSET_TRIM_OA1_SLOPE_OFFSET_TRIM_Msk (0x3fUL) /*!< CTBM OA1_SLOPE_OFFSET_TRIM: OA1_SLOPE_OFFSET_TRIM (Bitfield-Mask: 0x3f)*/
/* ==================================================  CTBM.OA1_COMP_TRIM  =================================================== */
#define CTBM_OA1_COMP_TRIM_OA1_COMP_TRIM_Pos (0UL)              /*!< CTBM OA1_COMP_TRIM: OA1_COMP_TRIM (Bit 0)                 */
#define CTBM_OA1_COMP_TRIM_OA1_COMP_TRIM_Msk (0x3UL)            /*!< CTBM OA1_COMP_TRIM: OA1_COMP_TRIM (Bitfield-Mask: 0x03)   */


#endif /* _CYIP_CTBM_H_ */


/* [] END OF FILE */
